In [1]:
import pandas as pd

Za začetek shranimo podatke o knjigah, žanrih in nagradah v nove spremenljivke. Za indeksni stolpec pri vseh treh izberem "id_knjige". Ta je določen enolično, saj ga vsaka knjiga dobi glede na mestno na lestvici, mesta pa se ne ponavljajo.

Opomba: Če kdaj želimo sortirati po "score", je vseeno če sortiramo po id_knjige, saj "score" določi mesto knjige na lestvici (knjiga z najvišjim se nahaja na prvem mestu).

In [7]:
knjige = pd.read_csv('../Najbolj-e-knjige-vseh-asov/PODATKI/knjige1.csv', index_col='id_knjige')

In [8]:
knjige

,knjiga,avtor,id_avtor,serija,opis,leto,zalozba,povprecna_ocena,score,st_glasov,st_ocen,st_reviewov
id_knjige,,,,,,,,,,,,
1,The Hunger Games,Suzanne Collins,153394,True,"Could you survive on your own in the wild, wit...",2008,Scholastic Press,4.32,3038423,30967,6594530,174351
2,Harry Potter and the Order of the Phoenix,J.K. Rowling,1077326,True,There is a door at the end of a silent corrido...,2004,Scholastic Inc.,4.50,2667804,27284,2610480,44296
3,To Kill a Mockingbird,Harper Lee,1825,True,The unforgettable novel of a childhood in a sl...,2006,Harper Perennial Modern Classics,4.28,2310794,23746,4676876,93730
4,Pride and Prejudice,Jane Austen,1265,False,"Since its immediate success in 1813, has re...",2000,Modern Library,4.27,2035188,20979,3111579,68675
5,Twilight,Stephenie Meyer,941441,True,About three things I was absolutely positive. ...,2006,"Little, Brown and Company",3.61,1472834,15011,5135602,106196
...,...,...,...,...,...,...,...,...,...,...,...,...
96,The Notebook,Nicholas Sparks,2345,True,Set amid the austere beauty of the North Carol...,2000,Grand Central Publishing,4.11,232271,2622,1370502,20322
97,Winnie-the-Pooh,A.A. Milne,81466,True,The adventures of Christopher Robin and his fr...,2001,Dutton Juvenile,4.32,223886,2634,282319,5017
98,The Complete Stories and Poems,Edgar Allan Poe,4624490,False,This single volume brings together all of Poe'...,1984,"Doubleday &amp; Company, Inc.",4.37,222915,2584,227749,2275
99,Interview with the Vampire,Anne Rice,7577,True,"This is the story of Louis, as told in his own...",2004,Ballantine Books,4.00,210756,2415,497802,10613
100,A Prayer for Owen Meany,John Irving,3075,False,"Eleven-year-old Owen Meany, playing in a Littl...",1990,Black Swan,4.23,209508,2306,289953,14061

In [49]:
zanri = pd.read_csv('../Najbolj-e-knjige-vseh-asov/PODATKI/zanri1.csv',index_col='id_knjige')

In [50]:
zanri

                   zanr
id_knjige
1           young-adult
1               fiction
1              dystopia
2               fantasy
2           young-adult
...                 ...
99              fantasy
99              fiction
100             fiction
100            classics
100        contemporary

[300 rows x 1 columns]

In [12]:
nagrade = pd.read_csv('../Najbolj-e-knjige-vseh-asov/PODATKI/nagrade1.csv',index_col='id_knjige')

In [13]:
nagrade

                                                     nagrada
id_knjige
1             Locus Award Nominee for Best Young Adult Book
1                                  Georgia Peach Book Award
1                                          Buxtehuder Bulle
1                         Golden Duck Award for Young Adult
1          Grand Prix de l'Imaginaire Nominee for Roman j...
...                                                      ...
94                 National Book Award Finalist for Fiction
95                               Pulitzer Prize for Fiction
95                                        Premio Bancarella
95                 National Book Award Finalist for Fiction
99             British Fantasy Award Nominee for Best Novel

[462 rows x 1 columns]

# Kateri žanri so najbolj priljubljeni?

Ugotoviti želim, kateri žanri so najbolj priljubleni med prvimi desettisočimi knjigami.
Ker se lahko zgodi, da je začetnih nekaj sto knjig(najbolje ocenjene) večinoma enega žanra, večinski preostanek pa drugega, bom analizirala najbolj priljubljen žanr za prvih 100, 1000 in 10000 knjig.
Ker pri vsaki knjigi zajamem tri žanre, moram za prvih 100 knjig torej vzeti prvih 300 žanrov. Podobno za 1000 in 10000 knjig.

In [57]:
priljubljeni_zanri_100 = zanri.head(300).groupby('zanr').size().to_frame('st_zanrov').sort_values('st_zanrov', ascending=False)

In [59]:
priljubljeni_zanri_100.head(10)

                    st_zanrov
zanr
fiction                    91
classics                   63
fantasy                    25
young-adult                21
historical-fiction         18
romance                    10
science-fiction             9
childrens                   7
horror                      6
mystery                     5

Med prvimi stotimi knjigami je torej...

# Ali med priljubljenemi knjigami prevladujejo serije?

Zanima nas tudi ali so bolj priljubljene serije ali posamezne knjige. 
možnost1:isto kot za zanre
moznost2:naredimo graf: y1= serije, x = vse knjige- in se y2 = ne serije, x=vse knjige->tist ki je zgoraj je večji

# Kateri avtorji in založbe so imeli največ uspešnic?

ideja:najti najbolj uspesnega avtorja pri najbolj priljubljenih zanrih
Znova bomo najuspešnejšega avtorja poiskali v različno velikih skupinah: 100, 1000 in 10000 knjig.

In [86]:
st_knjig_avtorja_100 = knjige[['avtor','id_avtor']].head(100).groupby('id_avtor').size().to_frame('st_knjig').sort_values('st_knjig', ascending=False)

In [87]:
st_knjig_avtorja_100

          st_knjig
id_avtor
1077326          4
3706             2
569              2
656983           2
239579           2
...            ...
3389             1
3347             1
3190             1
3167             1
4624490          1

[92 rows x 1 columns]

In [88]:
knjige[['avtor','id_avtor']]

                     avtor  id_avtor
id_knjige
1          Suzanne Collins    153394
2             J.K. Rowling   1077326
3               Harper Lee      1825
4              Jane Austen      1265
5          Stephenie Meyer    941441
...                    ...       ...
96         Nicholas Sparks      2345
97              A.A. Milne     81466
98         Edgar Allan Poe   4624490
99               Anne Rice      7577
100            John Irving      3075

[100 rows x 2 columns]

In [89]:
najbolsi_avtorji_100 = pd.merge(st_knjig_avtorja,knjige[['avtor','id_avtor']],left_on='id_avtor',right_on='id_avtor')

In [90]:
najboljsi_avtorji_100.drop_duplicates(keep='last').sort_values('st_knjig',ascending=False)

    id_avtor  st_knjig                         avtor
3    1077326         4                  J.K. Rowling
7        569         2               Khaled Hosseini
9     656983         2                J.R.R. Tolkien
11    239579         2               Charles Dickens
13   3137322         2            Fyodor Dostoyevsky
..       ...       ...                           ...
39   2778055         1             Kurt Vonnegut Jr.
38   4037220         1  Miguel de Cervantes Saavedra
37   4039811         1                 Veronica Roth
36      7128         1                  Jodi Picoult
99   4624490         1               Edgar Allan Poe

[92 rows x 3 columns]

J.K.Rowlin je torej napisala kar 4 izmed stotih najbolje ocenjenih knjig spletne strani....

Sedaj poiščimo še najbolj uspešno založbo.

In [91]:
st_knjig_zalozbe_100 = knjige[['zalozba']].head(100).groupby('zalozba').size().to_frame('st_knjig').sort_values('st_knjig', ascending=False)

In [92]:
st_knjig_zalozbe_100

                           st_knjig
zalozba
Penguin                           4
Penguin Books                     4
Ballantine Books                  4
Little, Brown and Company         3
Scribner                          2
...                             ...
Grand Central Publishing          1
Farrar, Straus and Giroux         1
Ember                             1
Dutton Juvenile                   1
Zola Books                        1

[79 rows x 1 columns]